Tinkerbug-Robotics/TinkerRocket/tinkerrocket-idf/projects/flight_computer/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"

# No power management — runs at full speed
CONFIG_PM_ENABLE=n

# No BLE on FlightComputer
CONFIG_BT_ENABLED=n

# Flash
# Boot NOR is a 128 Mbit (16 MB) part on every placement in the fleet
# (rocket-computer U13/U16): GD25Q128ESIG today, W25Q128JVSIQ on boards fabbed before
# 2026-08-15 — both 16 MB. Declaring 8 MB left half the part
# unreachable and made every boot log "Detected size(16384k) larger
# than the size in the binary image header(8192k)".
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# OTA rollback: a relayed image boots PENDING_VERIFY and auto-reverts to ota_0
# unless the FC marks itself valid after resuming its I2S telemetry stream to
# the OC post-reboot. See docs/plans/08-ota-firmware-update.md §4 / §7.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# Serial
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# --- ESP32-P4 / IDF version tuning (#88) ---------------------------------
# ESP32-P4 silicon: our boards are v1.x. IDF 5.5+ raises the default min chip
# rev to v3.x, which refuses to boot on v1.x. Accept the legacy series.
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y

# Brownout: IDF 5.5 defaults the P4 detector to 2.6V (LVL_SEL_7), which trips
# during servo-PWM init on this board. Pin to the most-lenient level (2.42V).
CONFIG_ESP_BROWNOUT_DET_LVL_SEL_5=y

# Main task stack: the 5.5 default (3584 B) overflows FC's synchronous sensor
# init when the Arduino loop stack isn't present. Restore the prior 16 KB.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384
